JayHeng/RT-SNAND/devices/MIMXRT1189/drivers/fsl_eqdc.h
    bool enableDma;                /*!< Enable DMA for new written buffer values of COMPx/INIT/MOD(x range is 0-3) */
    bool bufferedRegisterLoadMode; /*!<selects the loading time point of the buffered compare registers UCOMPx/LCOMPx,
                                       x=0~3, initial register (UINIT/LINIT), and modulus register (UMOD/LMOD). */

    bool enableTriggerInitPositionCounter;    /*!< Initialize position counter with initial register(UINIT, LINIT) value
                                               on TRIGGER's rising edge. */
    bool enableTriggerClearPositionRegisters; /*!< Clear position counter(POS), revolution counter(REV), position
                                                difference counter (POSD) on TRIGGER's rising edge. */
    bool enableTriggerHoldPositionRegisters;  /*!< Load position counter(POS), revolution counter(REV), position
                                                difference counter (POSD) values to hold registers  on TRIGGER's rising
                                                edge. */

    bool filterPhaseA; /*!< Filter operation on PHASEA input, when write 1, it means filter for PHASEA input is
                           bypassed. */
    bool filterPhaseB; /*!< Filter operation on PHASEB input, when write 1, it means filter for PHASEB input is
                           bypassed. */
    bool filterIndPre; /*!< Filter operation on INDEX/PRESET input, when write 1, it means filter for INDEX/PRESET
                           input is bypassed. */
    bool filterHomEna; /*!< Filter operation on HOME/ENABLE input, when write 1, it means filter for  HOME/ENABLE input
                           is bypassed. */

    /* Watchdog. */
    bool enableWatchdog;           /*!< Enable the watchdog to detect if the target is moving or not. */
    uint16_t watchdogTimeoutValue; /*!< Watchdog timeout count value. It stores the timeout count for the quadrature
                                        decoder module watchdog timer. */

    /* Filter for input signals: PHASEA, PHASEB, INDEX and HOME. */
    eqdc_prescaler_t prescaler;                   /*!< Prescaler. */
    bool filterClockSourceselection;              /*!< Filter Clock Source selection. */
    eqdc_filter_sample_count_t filterSampleCount; /*!< Input Filter Sample Count. This value should be chosen to reduce
                               the probability of noisy samples causing an incorrect transition to be recognized. The
                               value represent the number of consecutive samples that must agree prior to the input
                               filter accepting an input transition. */
    uint8_t filterSamplePeriod; /*!< Input Filter Sample Period. This value should be set such that the sampling
                                     period is larger than the period of the expected noise. This value represents the
                                      sampling period (in IPBus clock cycles) of the decoder input signals.
                                      The available range is 0 - 255. */

    /* Operate mode. */
    eqdc_operate_mode_t operateMode; /*!< Selects operation mode. */
    eqdc_count_mode_t countMode;     /*!< Selects count mode. */

    /* Signal detection. */
    eqdc_home_enable_init_pos_counter_mode_t homeEnableInitPosCounterMode;   /*!< Select how HOME/Enable signal used to
                                                                  initialize position counters. */
    eqdc_index_preset_init_pos_counter_mode_t indexPresetInitPosCounterMode; /*!< Select how INDEX/Preset signal used
                                                                  to initialize position counters. */

    /* Position compare. */
    eqdc_output_pulse_mode_t outputPulseMode; /*!< The condition of POSMATCH pulses. */
    uint32_t positionCompareValue[4]; /*!< Position compare 0 ~ 3 value. The available value is a 32-bit number.*/

    /* Modulus counting. */
    eqdc_revolution_count_condition_t revolutionCountCondition; /*!< Revolution Counter Modulus Enable. */
    bool enableModuloCountMode;                                 /*!< Enable Modulo Counting. */
    uint32_t positionModulusValue; /*!< Position modulus value. Only used when @ref enableModuloCountMode is true.
                                           The available value is a 32-bit number. */
    uint32_t positionInitialValue; /*!< Position initial value. The available value is a 32-bit number. */
    uint32_t positionCounterValue; /*!< Position counter value. When Modulo mode enabled, the positionCounterValue
                                           should be in the range of @ref positionInitialValue and
                                           @ref positionModulusValue. */

    /* Period measurement. */
    bool enablePeriodMeasurement; /*!< Enable period measurement. When enabled, the position difference hold register
                                      (POSDH) is only updated when position difference register (POSD) is read. */

    /* Interrupts. */
    uint16_t enabledInterruptsMask; /*!< Mask of interrupts to be enabled, should be OR'ed value of @ref
                                          _eqdc_interrupt_enable. */
} eqdc_config_t;

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

/*!
 * @name Initialization and deinitialization Interfaces
 * @{
 */

/*!
 * @brief Initializes the EQDC module.
 *
 * This function initializes the EQDC by enabling the IP bus clock (optional).
 *
 * @param base   EQDC peripheral base address.
 * @param psConfig Pointer to configuration structure.
 */
void EQDC_Init(EQDC_Type *base, const eqdc_config_t *psConfig);

/*!
 * @brief Gets an available pre-defined configuration.
 *
 * The default value are:
 * @code
    psConfig->enableReverseDirection              = false;
    psConfig->countOnce                           = false;
    psConfig->operateMode                         = kEQDC_QuadratureDecodeOperationMode;
    psConfig->countMode                           = kEQDC_QuadratureX4;
    psConfig->homeEnableInitPosCounterMode        = kEQDC_HomeInitPosCounterDisabled;
    psConfig->indexPresetInitPosCounterMode       = kEQDC_IndexInitPosCounterDisabled;
    psConfig->enableDma                           = false;
    psConfig->bufferedRegisterLoadMode            = false;
    psConfig->enableTriggerInitPositionCounter    = false;
    psConfig->enableTriggerClearPositionRegisters = false;
    psConfig->enableTriggerHoldPositionRegisters  = false;
    psConfig->enableWatchdog                      = false;
    psConfig->watchdogTimeoutValue                = 0xFFFFU;
    psConfig->filterPhaseA                        = 0U;
    psConfig->filterPhaseB                        = 0U;
    psConfig->filterIndPre                        = 0U;
    psConfig->filterHomEna                        = 0U;
    psConfig->filterClockSourceselection          = false;
    psConfig->filterSampleCount                   = kEQDC_Filter3Samples;
    psConfig->filterSamplePeriod                  = 0U;
    psConfig->outputPulseMode                     = kEQDC_OutputPulseOnCounterEqualCompare;
    psConfig->positionCompareValue[0]  	          = 0xFFFFFFFFU;
    psConfig->positionCompareValue[1]             = 0xFFFFFFFFU;
    psConfig->positionCompareValue[2]             = 0xFFFFFFFFU;
    psConfig->positionCompareValue[3]             = 0xFFFFFFFFU;
    psConfig->revolutionCountCondition            = kEQDC_RevolutionCountOnIndexPulse;
    psConfig->enableModuloCountMode               = false;
    psConfig->positionModulusValue                = 0U;
    psConfig->positionInitialValue                = 0U;
    psConfig->positionCounterValue                = 0U;
    psConfig->enablePeriodMeasurement             = false;
    psConfig->prescaler                           = kEQDC_Prescaler1;
    psConfig->enabledInterruptsMask               = 0U;
   @endcode
 *
 * @param psConfig Pointer to configuration structure.
 */
void EQDC_GetDefaultConfig(eqdc_config_t *psConfig);

/*!
 * @brief De-initializes the EQDC module.
 *
 * This function deinitializes the EQDC by disabling the IP bus clock (optional).
 *
 * @param base EQDC peripheral base address.
 */
void EQDC_Deinit(EQDC_Type *base);

/*!
 * @brief Initializes the mode of operation.
 *
 * This function initializes mode of operation by enabling the IP bus clock (optional).
 *
 * @param base   EQDC peripheral base address.
 * @param operateMode Select operation mode.
 */
void EQDC_SetOperateMode(EQDC_Type *base, eqdc_operate_mode_t operateMode);

/*!
 * @brief Initializes the mode of count.
 *
 * These bits control the basic counting and behavior of Position Counter and Position Difference Counter.
 * Setting CTRL[REV] to 1 can reverse the counting direction.
 * 1.In quadrature Mode (CTRL[PH1] = 0):
 *    00b - CM0: Normal/Reverse Quadrature X4
 *    01b - CM1: Normal/Reverse Quadrature X2
 *    10b - CM2: Normal/Reverse Quadrature X1
 *    11b - CM3: Reserved
 * 2.In Single Phase Mode (CTRL[PH1] = 1):
 *    00b - CM0: UP/DOWN Pulse Count Mode
 *    01b - CM1: Signed Mode, count PHASEA rising/falling edge, position counter counts up when PHASEB
 *    is low and counts down when PHASEB is high
 *    10b - CM2: Signed Count Mode,count PHASEA rising edge only, position counter counts up when
 *    PHASEB is low and counts down when PHASEB is high
 *    11b - CM3: Reserved
 *
 * @param base   EQDC peripheral base address.
 * @param countMode Select count mode.
 */
static inline void EQDC_SetCountMode(EQDC_Type *base, eqdc_count_mode_t countMode)
{
    base->CTRL2 = (base->CTRL2 & (uint16_t)(~EQDC_CTRL2_CMODE_MASK)) | EQDC_CTRL2_CMODE(countMode);
}

/*! @} */

/*!
 * @name Watchdog
 * @{
 */

/*!
 * @brief Enable watchdog for EQDC module.
 *
 * @param base EQDC peripheral base address
 * @param bEnable Enables or disables the watchdog
 */
static inline void EQDC_EnableWatchdog(EQDC_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL = (base->CTRL & (~EQDC_CTRL_W1C_FLAGS)) | EQDC_CTRL_WDE_MASK;
    }
    else
    {
        base->CTRL = (base->CTRL & (~(EQDC_CTRL_W1C_FLAGS | EQDC_CTRL_WDE_MASK)));
    }
}

/*!
 * @brief Set watchdog timeout value.
 *
 * @param base EQDC peripheral base address
 * @param u16Timeout Number of clock cycles, plus one clock cycle that the
 * watchdog timer counts before timing out
 */
static inline void EQDC_SetWatchdogTimeout(EQDC_Type *base, uint16_t u16Timeout)
{
    base->WTR = u16Timeout;
}

/*! @} */

/*!
 * @name DMA
 * @{
 */

/*!
 * @brief Enable DMA for EQDC module.
 *
 * @param base EQDC peripheral base address
 * @param bEnable Enables or disables the DMA
 */
static inline void EQDC_EnableDMA(EQDC_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CTRL |= EQDC_CTRL_DMAEN_MASK;
    }
    else
    {
#if (defined(FSL_FEATURE_EQDC_HAS_ERRATA_051383) & FSL_FEATURE_EQDC_HAS_ERRATA_051383)
        /* Quadrature decoder CTRL[DMAEN] bit can not be cleared except do EQDC reset*/
        assert(true);
#endif
        base->CTRL &= ~EQDC_CTRL_DMAEN_MASK;
    }
}

/*! @} */

/*!
 * @name Double-set Registers Loading Operation
 * @{
 */

/*!
 * @brief Set Buffered Register Load (Update) Mode.
 *
 * This bit selects the loading time point of the buffered compare registers UCOMPx/LCOMPx, x=0~3,
 * initial register (UINIT/LINIT), and modulus register (UMOD/LMOD).
 * Buffered registers are loaded and take effect at the next roll-over or roll-under if CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 */
static inline void EQDC_SetBufferedRegisterLoadUpdateMode(EQDC_Type *base)
{
    base->CTRL2 |= EQDC_CTRL2_LDMOD_MASK;
}

/*!
 * @brief Clear Buffered Register Load (Update) Mode.
 *
 * Buffered Register Load (Update) Mode bit selects the loading time point of the buffered compare registers
 * UCOMPx/LCOMPx, x=0~3, initial register (UINIT/LINIT), and modulus register (UMOD/LMOD). Buffered registers are loaded
 * and take effect immediately upon CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 */
static inline void EQDC_ClearBufferedRegisterLoadUpdateMode(EQDC_Type *base)
{
    base->CTRL2 &= ~EQDC_CTRL2_LDMOD_MASK;
}

/*!
 * @brief Set load okay.
 *
 * Load okay enables that the outer-set values of buffered compare registers (UCOMPx/LCOMPx, x=0~3),
 * initial register(UINIT/LINIT) and modulus register(UMOD/LMOD) can be loaded into their inner-sets and
 * take effect.
 * When LDOK is set, this loading action occurs at the next position counter roll-over or roll-under if
 * CTRL2[LDMOD] is set, or it occurs immediately if CTRL2[LDMOD] is cleared. LDOK is automatically
 * cleared after the values in outer-set is loaded into the inner-set.
 *
 * @param base EQDC peripheral base address.
 */
static inline void EQDC_SetEqdcLdok(EQDC_Type *base)
{
    base->CTRL |= EQDC_CTRL_LDOK_MASK;
}

/*!
 * @brief Get load okay.
 *
 * @param base EQDC peripheral base address.
 */
static inline uint8_t EQDC_GetEqdcLdok(EQDC_Type *base)
{
    return base->CTRL & EQDC_CTRL_LDOK_MASK;
}

/*!
 * @brief Clear load okay.
 *
 * @param base EQDC peripheral base address.
 */
static inline void EQDC_ClearEqdcLdok(EQDC_Type *base)
{
    base->CTRL &= ~EQDC_CTRL_LDOK_MASK;
}

/*! @} */

/*!
 * @name Status
 * @{
 */
/*!
 * @brief  Get the status flags.
 *
 * @param  base EQDC peripheral base address.
 *
 * @return  Logical OR'ed value of the status flags, @ref _eqdc_status_flags.
 */
static inline uint32_t EQDC_GetStatusFlags(EQDC_Type *base)
{
    uint32_t u32Flags = 0U;

    u32Flags = (uint32_t)(base->CTRL) & EQDC_CTRL_INT_FLAGS;

    u32Flags |= ((uint32_t)(base->INTCTRL) & EQDC_INTCTRL_INT_FLAGS) << 16;
    return u32Flags;
}

/*!
 * @brief Clear the status flags.
 *
 * @param base EQDC peripheral base address.
 * @param u32Flags Logical OR'ed value of the flags to clear, @ref _eqdc_status_flags.
 */
static inline void EQDC_ClearStatusFlags(EQDC_Type *base, uint32_t u32Flags)
{
    if (0U != (u32Flags & EQDC_CTRL_INT_FLAGS))
    {
        base->CTRL = (base->CTRL & (~EQDC_CTRL_W1C_FLAGS)) | (u32Flags & EQDC_CTRL_INT_FLAGS);
    }

    if (0U != ((u32Flags >> 16) & EQDC_INTCTRL_INT_FLAGS))
    {
        base->INTCTRL = (base->INTCTRL & (~EQDC_INTCTRL_W1C_FLAGS)) | ((u32Flags >> 16) & EQDC_INTCTRL_INT_FLAGS);
    }
}

/*!
 * @brief  Get the signals' real-time status.
 *
 * @param  base EQDC peripheral base address.
 * @return Logical OR'ed value of the real-time signal status, @ref _eqdc_signal_status.
 */
static inline uint16_t EQDC_GetSignalStatusFlags(EQDC_Type *base)
{
    return base->IMR;
}

/*!
 * @brief Get the direction of the last count.
 *
 * @param  base EQDC peripheral base address.
 * @return Direction of the last count.
 */
static inline eqdc_count_direction_flag_t EQDC_GetLastCountDirection(EQDC_Type *base)
{
    return ((0U != (base->IMR & EQDC_IMR_DIR_MASK)) ? kEQDC_CountDirectionUp : kEQDC_CountDirectionDown);
}
/*! @} */

/*!
 * @name Interrupts
 * @{
 */

/*!
 * @brief Enable the interrupts.
 *
 * @param base EQDC peripheral base address.
 * @param u32Interrupts Logical OR'ed value of the interrupts, @ref _eqdc_interrupt_enable.
 */
static inline void EQDC_EnableInterrupts(EQDC_Type *base, uint32_t u32Interrupts)
{
    if (0U != (u32Interrupts & EQDC_CTRL_INT_EN))
    {
        base->CTRL = (base->CTRL & (~EQDC_CTRL_W1C_FLAGS)) | (u32Interrupts & EQDC_CTRL_INT_EN);
    }

    if (0U != ((u32Interrupts >> 16) & EQDC_INTCTRL_INT_EN))
    {
        base->INTCTRL = (base->INTCTRL & (~EQDC_INTCTRL_W1C_FLAGS)) | ((u32Interrupts >> 16) & EQDC_INTCTRL_INT_EN);
    }
}

/*!
 * @brief Disable the interrupts.
 *
 * @param base EQDC peripheral base address.
 * @param u32Interrupts Logical OR'ed value of the interrupts, @ref _eqdc_interrupt_enable.
 */
static inline void EQDC_DisableInterrupts(EQDC_Type *base, uint32_t u32Interrupts)
{
    if (0U != (u32Interrupts & EQDC_CTRL_INT_EN))
    {
        base->CTRL = (base->CTRL & (~EQDC_CTRL_W1C_FLAGS)) & (~(u32Interrupts & EQDC_CTRL_INT_EN));
    }

    if (0U != ((u32Interrupts >> 16) & EQDC_INTCTRL_INT_EN))
    {
        base->INTCTRL = (base->INTCTRL & (~EQDC_INTCTRL_W1C_FLAGS)) & (~((u32Interrupts >> 16) & EQDC_INTCTRL_INT_EN));
    }
}

/*! @} */

/*!
 * @name Counter Operation
 * @{
 */

/*!
 * @brief Load the initial position value to position counter.
 *
 * Software trigger to load the initial position value (UINIT and LINIT) contents
 * to position counter (UPOS and LPOS), so that to provide the consistent
 * operation the position counter registers.
 *
 * @param base EQDC peripheral base address.
 */
static inline void EQDC_DoSoftwareLoadInitialPositionValue(EQDC_Type *base)
{
    base->CTRL = (base->CTRL & (~EQDC_CTRL_W1C_FLAGS)) | EQDC_CTRL_SWIP_MASK;
}

/*!
 * @brief Set initial position value for EQDC module.
 *
 * Set the position counter initial value (UINIT, LINIT).
 * After writing values to the UINIT and LINIT registers, the values are "buffered" into outer-set
 * registers temporarily. Values will be loaded into inner-set registers and take effect using
 * the following two methods:
 * 1. If CTRL2[LDMODE] is 1, "buffered" values are loaded into inner-set and take effect
 * at the next roll-over or roll-under if CTRL[LDOK] is set.
 * 2. If CTRL2[LDMODE] is 0, "buffered" values are loaded into inner-set and take effect
 * immediately when CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 * @param u32PositionInitValue Position initial value
 */
static inline void EQDC_SetInitialPositionValue(EQDC_Type *base, uint32_t u32PositionInitValue)
{
    base->UINIT = (uint16_t)(u32PositionInitValue >> 16U);
    base->LINIT = (uint16_t)(u32PositionInitValue);
}

/*!
 * @brief Set position counter value.
 *
 * Set the position counter value (POS or UPOS, LPOS).
 *
 * @param base EQDC peripheral base address
 * @param positionCounterValue Position counter value
 */
static inline void EQDC_SetPositionCounterValue(EQDC_Type *base, uint32_t positionCounterValue)
{
    base->UPOS = (uint16_t)(positionCounterValue >> 16U);
    base->LPOS = (uint16_t)(positionCounterValue);
}

/*!
 * @brief Set position counter modulus value.
 *
 * Set the position counter modulus value (UMOD, LMOD).
 * After writing values to the UMOD and LMOD registers, the values are "buffered" into outer-set
 * registers temporarily. Values will be loaded into inner-set registers and take effect using
 * the following two methods:
 * 1. If CTRL2[LDMODE] is 1, "buffered" values are loaded into inner-set and take effect
 * at the next roll-over or roll-under if CTRL[LDOK] is set.
 * 2. If CTRL2[LDMODE] is 0, "buffered" values are loaded into inner-set and take effect
 * immediately when CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 * @param positionModulusValue Position modulus value
 */
static inline void EQDC_SetPositionModulusValue(EQDC_Type *base, uint32_t positionModulusValue)
{
    base->UMOD = (uint16_t)(positionModulusValue >> 16U);
    base->LMOD = (uint16_t)(positionModulusValue);
}

/*!
 * @brief Set position counter compare 0 value.
 *
 * Set the position counter compare 0 value (UCOMP0, LCOMP0).
 * After writing values to the UCOMP0 and LCOMP0 registers, the values are "buffered" into outer-set
 * registers temporarily. Values will be loaded into inner-set registers and take effect using
 * the following two methods:
 * 1. If CTRL2[LDMODE] is 1, "buffered" values are loaded into inner-set and take effect
 * at the next roll-over or roll-under if CTRL[LDOK] is set.
 * 2. If CTRL2[LDMODE] is 0, "buffered" values are loaded into inner-set and take effect
 * immediately when CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 * @param u32PositionComp0Value Position modulus value
 */
static inline void EQDC_SetPositionCompare0Value(EQDC_Type *base, uint32_t u32PositionComp0Value)
{
    base->UCOMP0 = (uint16_t)(u32PositionComp0Value >> 16U);
    base->LCOMP0 = (uint16_t)(u32PositionComp0Value);
}

/*!
 * @brief Set position counter compare 1 value.
 *
 * Set the position counter compare 1 value (UCOMP1, LCOMP1).
 * After writing values to the UCOMP1 and LCOMP1 registers, the values are "buffered" into outer-set
 * registers temporarily. Values will be loaded into inner-set registers and take effect using
 * the following two methods:
 * 1. If CTRL2[LDMODE] is 1, "buffered" values are loaded into inner-set and take effect
 * at the next roll-over or roll-under if CTRL[LDOK] is set.
 * 2. If CTRL2[LDMODE] is 0, "buffered" values are loaded into inner-set and take effect
 * immediately when CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 * @param u32PositionComp1Value Position modulus value
 */
static inline void EQDC_SetPositionCompare1Value(EQDC_Type *base, uint32_t u32PositionComp1Value)
{
    base->UCOMP1 = (uint16_t)(u32PositionComp1Value >> 16U);
    base->LCOMP1 = (uint16_t)(u32PositionComp1Value);
}

/*!
 * @brief Set position counter compare 2 value.
 *
 * Set the position counter compare 2 value (UCOMP2, LCOMP2).
 * After writing values to the UCOMP2 and LCOMP2 registers, the values are "buffered" into outer-set
 * registers temporarily. Values will be loaded into inner-set registers and take effect using
 * the following two methods:
 * 1. If CTRL2[LDMODE] is 1, "buffered" values are loaded into inner-set and take effect
 * at the next roll-over or roll-under if CTRL[LDOK] is set.
 * 2. If CTRL2[LDMODE] is 0, "buffered" values are loaded into inner-set and take effect
 * immediately when CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 * @param u32PositionComp2Value Position modulus value
 */
static inline void EQDC_SetPositionCompare2Value(EQDC_Type *base, uint32_t u32PositionComp2Value)
{
    base->UCOMP2 = (uint16_t)(u32PositionComp2Value >> 16U);
    base->LCOMP2 = (uint16_t)(u32PositionComp2Value);
}

/*!
 * @brief Set position counter compare 3 value.
 *
 * Set the position counter compare 3 value (UCOMP3, LCOMP3).
 * After writing values to the UCOMP3 and LCOMP3 registers, the values are "buffered" into outer-set
 * registers temporarily. Values will be loaded into inner-set registers and take effect using
 * the following two methods:
 * 1. If CTRL2[LDMODE] is 1, "buffered" values are loaded into inner-set and take effect
 * at the next roll-over or roll-under if CTRL[LDOK] is set.
 * 2. If CTRL2[LDMODE] is 0, "buffered" values are loaded into inner-set and take effect
 * immediately when CTRL[LDOK] is set.
 *
 * @param base EQDC peripheral base address
 * @param u32PositionComp3Value Position modulus value
 */
static inline void EQDC_SetPositionCompare3Value(EQDC_Type *base, uint32_t u32PositionComp3Value)
{
    base->UCOMP3 = (uint16_t)(u32PositionComp3Value >> 16U);
    base->LCOMP3 = (uint16_t)(u32PositionComp3Value);
}

/*!
 * @brief  Get the current position counter's value.
 *
 * @param  base EQDC peripheral base address.
 *
 * @return Current position counter's value.
 */
static inline uint32_t EQDC_GetPosition(EQDC_Type *base)
{
    uint32_t u32Pos;

    u32Pos = base->UPOS; /* Get upper 16 bits and make a snapshot. */
    u32Pos <<= 16U;
    u32Pos |= base->LPOSH; /* Get lower 16 bits from hold register. */

    return u32Pos;
}

/*!
 * @brief  Get the hold position counter's value.
 *
 * The position counter (POS or UPOS, LPOS) value is loaded to hold position (POSH or UPOSH, LPOSH)
 * when:
 *   1. Position register (POS or UPOS, LPOS), or position difference register (POSD),
 *   or revolution register (REV) is read.
 *   2. TRIGGER happens and TRIGGER is enabled to update the hold registers.
 *
 * @param  base EQDC peripheral base address.
 * @return Hold position counter's value.
 */
static inline uint32_t EQDC_GetHoldPosition(EQDC_Type *base)
{
    uint32_t u32Pos;

